          05 CUST-ID PIC X(6).                                          
          05 CUST-NAME PIC X(30).                                       
          05 CUST-REGION PIC X(2).                                      
          05 CUST-STATUS PIC X(1).                                      
          05 CUST-CREDIT-LIMIT PIC 9(7)V99.                             
          05 CUST-CURRENT-BAL PIC 9(7)V99.                              
          05 LAST-ACT-DATE PIC X(8).                                    
